[
  {
    "title": "Fahd: The last Saudi King; Muslim Perspective May 1985",
    "content": "  Proclaiming the only religion acceptable to God Proclaiming the only religion acceptable to God FAHD: THE LAST SAUDI KING The Saudi tyrants have declared war on God, and God is sure to win. And the tyrants are fuming mad at me because I turned down their offer to buy me for a million dollars. They have grown accustomed to see our ‘Ulama bow down before their mighty dollar, and readily join their flimsy army of Satan. In the face of this phenomenal popularity among all enlightened Muslims, the blind Saudi dynasty has mobilized a number of “Ulama” who are willing to make asses of themselves in return for a few dollars. I apologize to all the asses of the world for insulting them by stating that a highly placed scholar who makes such absurd statements is making an ass of himself. (Rashad Khalifa, Editor) months after publishing the results, the letters came pouring",
    "url": "https://www.masjidtucson.org/publications/books/sp/1985/may/page1.html",
    "year": "1985",
    "month": "may",
    "page": "page1",
    "scraped_at": "2025-05-30T06:45:17.887466",
    "word_count": 153
  },
  {
    "title": "A Profound Miracle; Miracle of the Quran; Muslim Perspective May 1985",
    "content": "Submitters Perspective Submitters Perspective What I fed into the computer included one ALL WE CAN SAY, THEREFORE, IS \"SUB-HANA ALLAH\" \"GOD BE GLORIFIED.\" Al-Ikhlas (Absoluteness) Al-FIL (The Elephant) Quraish (The Quraish Tribe) Al-Masad (Thorny Fibres) Al-Duha (The Forenoon) Al-Asr (The Afternoon) Al-Humaza (The Niggardly) Al-Hujurat (The Walls) Al-Qalam (The Pen) ********* Al-Mumtahina (The Test) Al-Dhariyat (The Blowing Winds) Al-Rahman (The Compassionate) Al-Jathiya (Amenability) Al-Hashr (The Thronging) Luqman (Prophet Luqman) Al-Dukhan (Air Pollution) Al-Sajda (Prostration) Al-Mujadala (The Argument)",
    "url": "https://www.masjidtucson.org/publications/books/sp/1985/may/page2.html",
    "year": "1985",
    "month": "may",
    "page": "page2",
    "scraped_at": "2025-05-30T06:45:18.557306",
    "word_count": 77
  },
  {
    "title": "Obey GOD and the Prophet; Muslim Perspective May 1985",
    "content": "Submitters Perspective Submitters Perspective The object of worship is God ALONE. The Muslims, however, have been preoccupied with their idolization of the Prophet in much the same way as the Christians’ preoccupation with Jesus. The only difference being that the Muslims are not aware of their idolatry. Here is a list of daily transgressions by the average Muslim against God and the Prophet:",
    "url": "https://www.masjidtucson.org/publications/books/sp/1985/may/page3.html",
    "year": "1985",
    "month": "may",
    "page": "page3",
    "scraped_at": "2025-05-30T06:45:19.206209",
    "word_count": 63
  },
  {
    "title": "Who are We?; Muslim Perspective May 1985",
    "content": "Submitters Perspective Submitters Perspective MASJID TUCSON United Submitters International PO Box 43476 Tucson AZ 85733-3476 USA Tel/Fax: (520) 323 7636 During the last 14 centuries traditions, customs, superstitions and innovations have crept into Islam. Gradually, these distortions came to be vested with such religious solemnity that anyone who questions them finds HIMSELF regarded as the dangerous innovator and heretic. Islam today is a precious jewel that is buried under piles upon piles of man-made innovations. Our aim is to eradicate all distortions and present the jewel of Islam to the world.",
    "url": "https://www.masjidtucson.org/publications/books/sp/1985/may/page4.html",
    "year": "1985",
    "month": "may",
    "page": "page4",
    "scraped_at": "2025-05-30T06:45:19.855561",
    "word_count": 91
  },
  {
    "title": "Salat: Contact Prayer; Muslim Perspective May 1986",
    "content": "  Proclaiming the only religion acceptable to God Proclaiming the only religion acceptable to God SALAT: CONTACT PRAYER",
    "url": "https://www.masjidtucson.org/publications/books/sp/1986/may/page1.html",
    "year": "1986",
    "month": "may",
    "page": "page1",
    "scraped_at": "2025-05-30T06:45:48.885435",
    "word_count": 17
  },
  {
    "title": "Muslim 'Ulama Challenge God: Produce something \"equal\" to Quran; Muslim Perspective May 1986",
    "content": "Submitters Perspective Submitters Perspective IS THIS NOT THE SAME AS CHALLENGING GOD BACK? IS THIS NOT EQUAL TO ADMITTING THE ACCEPTANCE OF GODâS CHALLENGE TO PRODUCE SOMETHING SIMILAR OR EQUAL TO QURâAN? IS THIS NOT A WORD FOR WORD FULFILLMENT OF GODâS PROPHECY?",
    "url": "https://www.masjidtucson.org/publications/books/sp/1986/may/page2.html",
    "year": "1986",
    "month": "may",
    "page": "page2",
    "scraped_at": "2025-05-30T06:45:49.541322",
    "word_count": 43
  },
  {
    "title": "Muslim âUlama Challenge God; Muslim Perspective May 1986",
    "content": "Submitters Perspective Submitters Perspective MASJID TUCSON United Submitters International PO Box 43476 Tucson AZ 85733-3476 USA Tel/Fax: (520) 323 7636",
    "url": "https://www.masjidtucson.org/publications/books/sp/1986/may/page4.html",
    "year": "1986",
    "month": "may",
    "page": "page4",
    "scraped_at": "2025-05-30T06:45:50.837300",
    "word_count": 20
  },
  {
    "title": "Imam Ali & Imam Hussein did not fight for power; Muslim Perspective May 1987",
    "content": "  Proclaiming the only religion acceptable to God Proclaiming the only religion acceptable to God Ali and Hussein gave their lives attempting to remove two false sentences falsely added at the end of the last Sura revealed in Medina, namely, Sura Tawbah (No. 9). The falsehood was added when the Prophet’s Qur’an was duplicated by ‘Uthman’s committee for distribution throughout the Muslim world. The falsifiers waged war on Ali, and Ali fought back, seeking to remove the falsehood, After the martyrdom of Ali, Hussein continued the fight. Actual Size Photocopy From Hashim Amir-Ali’s Translation 127 Whensoever is recited a Sura, one of them looks at another: “Does any one see you?” Imam Ali and Imam Hussein gave their lives to remove these two false verses and restore the Qur’an to its pristine purity. Overwhelming evidence has now accumulated exposing the falsehood of the two verses (see M.P. of March & April 1985, and September 1986). Additionally, these two verses clearly contradict the Qur’an, both in principles as well as linguistically.",
    "url": "https://www.masjidtucson.org/publications/books/sp/1987/may/page1.html",
    "year": "1987",
    "month": "may",
    "page": "page1",
    "scraped_at": "2025-05-30T06:46:20.187677",
    "word_count": 169
  },
  {
    "title": "Letters and comments from subscribers; They do not understand Shirk; Muslim Perspective May 1987",
    "content": "Submitters Perspective Submitters Perspective I observed that one of your videotapes is titled, âIn defence of the Bible.â You made it appear as though, the Bible is the word of Allah. Dr. Khalifa as a research and investigative scholar, you ought to know better. The Bible, both the old and new testament, has lost its originality and authenticity, it has undergone countless revisions and interpolations. Truth are mixed with falsehood. The Holy Qurâan says, very specifically, âWoe unto those who write the book with their own hands, then say it is from Allah.â The Book (Injeel) that the prophet Jesus received from Allah, is nowhere to be found, it has vanished from the face of the earth. The four gospels were supposedly written by Matthew, Mark, Luke and John, who were not even his disciples. The gospel of Mark was found 150 years after the supposed death of the Prophet Jesus, in the greek language. Matthew, Luke and John gospels were found at a much later date, somewhere between 200-300 AD and all were written in the greek language. Gospels is a complete fabrication.â apostle. This editorial, which represents the general belief of the Muslim masses, clearly reveals two major disasters:",
    "url": "https://www.masjidtucson.org/publications/books/sp/1987/may/page2.html",
    "year": "1987",
    "month": "may",
    "page": "page2",
    "scraped_at": "2025-05-30T06:46:20.851574",
    "word_count": 201
  },
  {
    "title": "International Conference of UIN; Who are We?; Muslim Perspective May 1987",
    "content": "Submitters Perspective Submitters Perspective MASJID TUCSON United Submitters International PO Box 43476 Tucson AZ 85733-3476 USA Tel/Fax: (520) 323 7636",
    "url": "https://www.masjidtucson.org/publications/books/sp/1987/may/page4.html",
    "year": "1987",
    "month": "may",
    "page": "page4",
    "scraped_at": "2025-05-30T06:46:22.156791",
    "word_count": 20
  }
]